I have the same issue, each time I run terraform dps get replaced.

`resource "azurerm_iothub_dps" "main" {
  name                          = local.iothub_name
  resource_group_name           = data.azurerm_resource_group.main.name
  location                      = "East US"
  
  sku {
    name     = "S1"
    capacity = "1"
  }

  linked_hub {
    allocation_weight       = 0
    apply_allocation_policy = true
    connection_string       = format("HostName=%s;SharedAccessKeyName=%s;SharedAccessKey=%s", azurerm_iothub.main.hostname, "iothubowner", data.azurerm_key_vault_secret.iothub_main_iothubowner_primary_key.value) 
    location                = data.azurerm_resource_group.main.location
  }

  tags = {
    environment = var.environment
  }
}`

result:
`# azurerm_iothub_dps.main must be replaced
-/+ resource "azurerm_iothub_dps" "main" {
    ~ allocation_policy             = "Hashed" -> (known after apply)
    ~ device_provisioning_host_name = "global.azure-devices-provisioning.net" -> (known after apply)
    ~ id                            = "xxx" -> (known after apply)
    ~ id_scope                      = "xxx" -> (known after apply)
    location                      = "eastus"
    name                          = "xxx"
    resource_group_name           = "xxx"
    ~ service_operations_host_name  = "xxx.azure-devices-provisioning.net" -> (known after apply)
    tags                          = {
        "environment" = "prod"
    }

    ~ linked_hub {
        allocation_weight       = 0
        apply_allocation_policy = true
        ~ connection_string       = (sensitive value)
        ~ hostname                = "xxx.azure-devices.net" -> (known after apply)
        location                = "canadaeast"
    }

    sku {
        capacity = 1
        name     = "S1"
    }
}`


